subjects = (
        (1, 'Белорусский язык', 'бел.яз.'),
        (2, 'Белорусская литература', 'бел.лит'),
        (3, 'Русский язык', 'рус.яз.'),
        (4, 'Русская литература', 'рус.лит'),
        (5, 'Иностранный язык', 'иностр.яз'),
        (6, 'Математика', 'матем.'),
        (7, 'Информатика', 'инфор.'),
        (8, 'Человек и мир', 'чел.и мир'),
        (9, 'Всемирная история', 'история'),
        (10, 'История Беларуси', 'история'),
        (11, 'Обществоведение', 'обществовед.'),
        (12, 'География', 'география'),
        (13, 'Биология', 'биология'),
        (14, 'Физика', 'физика'),
        (15, 'Астрономия', 'астрон.'),
        (16, 'Химия', 'химия'),
        (17, 'Изобразительное искусство', 'изобр.иск-во'),
        (18, 'Музыка', 'музыка'),
        (19, 'Трудовое обучение', 'труд.обучен.'),
        (20, 'Искусство', 'искусство'),
        (21, 'Физическая культура и здоровье', 'физ.культ.и зд.'),
        (22, 'Допризывная и медицинская подготовка', 'ДП, МП'),
        (23, 'Основы безопасности жизнедеятельности', 'ОБЖ'),
        (24, 'Черчение', 'черчение'),
    )
combo_subj = ('Белорусский язык', 'Белорусская литература', 'Русский язык', 'Русская литература', 'Иностранный язык',
              'Математика', 'Информатика', 'Человек и мир', 'Всемирная история', 'История Беларуси', 'Обществоведение',
              'География', 'Биология', 'Физика', 'Астрономия', 'Химия', 'Изобразительное искусство', 'Музыка',
              'Трудовое обучение', 'Искусство', 'Физическая культура и здоровье', 'Допризывная подготовка',
              'Медицинская подготовка', 'Основы безопасности жизнедеятельности', 'Черчение', 'ЧЗС')

combo_tags = ('combo_1', 'combo_2', 'combo_3', 'combo_4', 'combo_5', 'combo_6', 'combo_7', 'combo_8', 'combo_9', 'combo_10')
# value_for_combo_tags = (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)

rows_tags = {'subject_table': ('subject_id', 'subject_name', 'short_subject_name'),
              'classes_table': ('class_id', 'class', 'students_value'),
              'rooms_table': ('room_id', 'room_name', 'max_value'),
              'teachers_table': ('teacher_id', 'teacher_flf', 'job_title', 'teachers_subjects'),
             'lessons_table': ('lesson_id', 'lesson')}

tables_tags = ("subject_table", 'classes_table', 'rooms_table', 'teachers_table', 'lessons_table')

table_dict = {'subject_table': ('Предметы', 'ID предмета', 'Название предмета', 'Краткое название'),
              'classes_table': ('Классы', 'ID класса', 'Класс', 'Количество учащихся'),
              'rooms_table': ('Кабинеты', 'ID кабинета', 'Название кабинета', 'Вместимость'),
              'teachers_table': ('Учителя', 'ID учителя', 'ФИО учителя', 'Должность', 'Предметы'),
              'lessons_table': ('Уроки', 'ID урока', 'Урок'),
              'days_table': ('Дни', 'ID дня', 'Название'),
              'allTime_table': ('Все время', 'ID времени', 'ID дня', 'ID урока'),
              'banTable': ('Запреты', 'ID учителя', 'ID времени'),
              'thachers_to_classes': ('Нагрузка', 'ID учителя', 'ID предмета', 'ID класса'),
              'sp_table': ('Учебные планы', 'ID класса', 'ID предмета', 'Часы в неделю'),
              'bloks_hs': ('Блоки СШ', 'ID блока', 'ID учителя', 'ID предмета', 'ID класса', 'Тип', 'Интенсивность'),
              'smena_2': ('2 смена', 'ID класса')
              }

# schedule_itog = {'schedule': ('Расписание', 'Класс', 'Урок', 'Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница')}
schedule_itog = {'schedule': ('Расписание', 'Класс', 'Урок', 'Занятие')}

# smena = False
# dict_teachersToClasses = {}
# list_tTC_keys = []
# dict_teachersBan = []
# list_tB_keys = []


max_weekly_load = (
        ('1', 22),
        ('2', 22),
        ('3', 24),
        ('4', 24),
        ('5', 27),
        ('5 повыш', 28),
        ('6', 30),
        ('6 повыш', 31),
        ('7', 30),
        ('7 повыш', 31),
        ('8', 31),
        ('8 повыш', 32),
        ('9', 33),
        ('10', 34),
        ('11', 34),
    )
mdnun_col_name = ('Класс', 'МДНУН')

additional_tables = ('МДНУН')

# value_combo = ""
week = ('Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница')

big_let_start = 0x00C0
big_let_end = 0x00DF
small_let_end = 0x00FF
remap_big_let = 0x0410
alph_len = big_let_end - big_let_start + 1
alph_shift = remap_big_let - big_let_start