USE sema;
INSERT INTO `справочник «ТС»`(`Идентификационный номер`, `Название ТС`, `Тип средства`, `Основные характеристики`, 
`Дата покупки`, `Дата ввода в эксплуатацию`)
VALUES 
('19150720A10', 'Системный блок MultiOffice C190D4S24', 'Средство вычислительной техники',
 'Процессор – Intel Celeron, Оперативная память – 4 Гб, жесткий диск – 240 Гб', 
 '2020.07.15', '2020.07.20'),
('15290318A02','Системный блок N-Tech I-D', 'Средство вычислительной техники', 
'Процессор – Intel Celeron, Оперативная память – 4 Гб, жесткий диск – 120 Гб',
 '2018.03.29', '2018.04.10');