USE sema;
INSERT INTO `справочник «ПС»`(`Идентификационный номер`, `Название ПС`, `Тип изделия`,
    `Версия ПС`, `Фирма-производитель ПС`, `Дата поставки`,
     `Список отделов пользователей`)
VALUES 
('17200318A12', 'Microsoft Excel','прикладное','Excel 2019 (17)',
'Microsoft','2018.03.20','Вычислительный центр, бухгалтерия, планово-экономический'),
('16150418A13', 'Microsoft Word','прикладное','Word 2016 (16.0)',
'Microsoft','2018.04.15','Вычислительный центр, бухгалтерия, отдел кадров, отдел документационного обеспечения');